balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F3012E.PIC
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF3" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF3" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF3" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF3" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF4" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF4" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF4" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF4" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF5" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF5" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF5" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF5" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF6" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF6" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF6" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF6" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF7" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF7" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF7" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF7" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF8" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF8" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF8" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF8" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUF9" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUF9" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF9" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUF9" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUFA" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUFA" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUFA" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUFA" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUFB" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUFB" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUFB" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUFB" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrrrrrrrrrr" edc:cname="ADCBUFC" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu" edc:name="ADCBUFC" edc:nzwidth="0x10" edc:por="----xxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUFC" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="ADCBUFC" edc:nzwidth="0xc"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
